//! Об'єктна модель документа(DOM-дерево)
console.warn(`Об'єктна модель документа(DOM-дерево): \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_17/images/browser-js.png"}`);
//? ✳️ Коли ми працюємо з браузером,
//? доступний функціонал складається з декількох модулів,
//? оскільки JavaScript не має інструментів для роботи з браузером.
//? ✴️ ECMAScript — мова програмування, 
//? яка вбудовується розширюваною мовою програмування, 
//? що не має засобів введення-виведення, 
//? і використовується як основа для побудови інших скриптових мов.
//? ✴️ Об'єктна модель документа (Document Object Model)
//? - незалежний від мови інтерфейс для роботи з HTML-документом.
//? Містить набір властивостей і методів, що дозволяють шукати,
//? створювати і видаляти елементи, реагувати на дії користувача
//? і багато іншого.
//? Тобто з'єднує сторінку з мовою програмування.
//? ✳️ DOM - це відображення HTML-документа,
//? деревоподібна структура, в якій кожен вузол
//? - це JavaScript-об'єкт з властивостями і методами,
//? що становить частину HTML-документа.
//? Кожен елемент в документі, весь документ в цілому, заголовок,
//? посилання, абзац - це частини DOM цього документа,
//? тому всі вони можуть бути змінені з JavaScript-коду.
//? ✴️ Об'єктна модель браузера (Browser Object Model) 
//? - незалежний від мови інтерфейс для роботи з вкладкою браузера. 
//? Містить набір властивостей і методів, 
//? що дозволяють отримати доступ безпосередньо до поточної вкладки 
//? і ряду функцій браузера. 
//? Містить об'єкт роботи з історією навігації, 
//? місцем розташування та багато іншого.
console.log(
    `%c
    🟨 ECMAScript — мова програмування
    🟦 Document Object Model - для відображення HTML-документа
    🟥 Browser Object Model -  для роботи з вкладкою браузера
    `,
    'color: gray; font-size: 16px',
);
console.log("---------------------------------------------------------------------------------------------");


//! HTML-документ і DOM
console.warn(`HTML-документ і DOM: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_17/images/dom-tree.png"}`);
//? ✴️ Згідно з DOM-моделлю,
//? 🔸 кожен тег утворює окремий елемент-вузол,
//? 🔸 кожен фрагмент тексту - текстовий елемент.
//? HTML-документ - це ієрархічне дерево,
//? в якому у кожного елемента (крім кореневого)
//? є тільки один батьківський елемент,
//? тобто елемент, всередині якого він розташовується.
//? Це дерево утворюється за рахунок
//? вкладеної структури тегів і текстових елементів.
//? ✳️ Щоб відобразити HTML-документ,
//? браузер спочатку перетворює його у формат,
//?  який він розуміє - DOM.
//? Рушій браузера має спеціальний фрагмент коду
//? - HTML-парсер, який використовується для перетворення HTML в DOM.
//? ✳️ В HTML вкладеність визначає відносини батько-дитина між елементами.
//? В DOM об'єкти пов'язані у деревоподібній структурі даних, фіксуючи ці відносини.
//? ✳️ Браузер будує DOM поступово,
//? щойно надходять перші фрагменти коду,
//? він починає парсити HTML,
//? додаючи вузли у деревоподібну структуру.
//? ❗️❗️❗️ Після того, як DOM-дерево побудовано, 
//? у ньому можна знайти елемент за допомогою JavaScript 
//? і виконувати з ним певні дії, 
//? оскільки кожен елемент має інтерфейс 
//? з безліччю властивостей і методів.
console.log("---------------------------------------------------------------------------------------------");



//! DOM-дерево
console.warn("DOM-дерево:");
console.warn("генератор DOM-дерева: \n  https://software.hixie.ch/utilities/js/live-dom-viewer");
//? ✴️ Візуалізуємо дерево HTML-документа (приклад нижче),
//? використовуючи сервіс генератора DOM-дерева:
console.log(
    `%c
    <!DOCTYPE html>
    <html>
        <head>
            <title>Document title</title>
        </head>
        <body>
            це текст
            <h1>Page title</h1>
            це текст 2
            <ul>
                <li>
                    <a href="#">Link 1</a>
                </li>
                <li>
                    <a href="#">Link 2</a>
                </li>
            </ul>
        </body>
    </html>
    `,
    'color: blue; font-size: 16px',
);
//? ✳️ У цьому дереві виділені два типи вузлів:
//? 🔸 Вузли-елементи (element node)
//?    - утворюються тегами, звичайним чином одні елементи вкладені в інші.
//?    Структура дерева утворена виключно за рахунок них.
//? 🔸 Текстові вузли (text node)
//?    - утворюються текстом всередині елементів.
//?    Текстовий вузол містить тільки рядок тексту
//?    і не може мати дочірніх елементів,
//?    тобто він завжди на найнижчому рівні ієрархії.
//?    Пробіли і перенесення рядків - це теж текстові вузли.
//? ❗️❗️❗️ З цього правила є винятки:
//? 🔸 пробіли до head ігноруються,
//? 🔸 а будь-який вміст після body не створює елемент,
//?    браузер переносить його в кінець 'body'.
console.log("---------------------------------------------------------------------------------------------");
