//! Метод findIndex()
console.warn("Синтаксис методу findIndex():");
//? ✴️ Метод findIndex(callback)
//? - це сучасна заміна методу indexOf().
//? Дозволяє виконувати пошук за складнішими умовами,
//? ніж просто рівність.
//? Використовується як для пошуку
//? у масиві примітивів, так і в масиві об'єктів.
//? 🔸 Поелементо перебирає оригінальний масив.
//? 🔸 Не змінює оригінальний масив.
//? 🔸 Повертає індекс першого елемента, що задовольняє умову,
//?    тобто коли колбек повертає true.
//? 🔸 Якщо жоден елемент не задовольнив умову,
//?    тобто для всіх елементів колбек повернув false,
//?    метод повертає -1.
//? ✳️ Аргументи колбек-функції - це:
//? 🔹 значення поточного елемента element,
//? 🔹 його індекс index
//? 🔹 і власне вихідний масив array.
console.log(
    `%c
    масив.findIndex((element, index, array) => {
        // тіло колбек-функції
    });
    `,
    'color: blue; font-size: 18px',
);

console.warn("Приклад використання метода findIndex():");
//? ✳️ Приклад-1:
const colorPickerOptions2 = [
    { label: "red", color: "#F44336" },
    { label: "green", color: "#4CAF50" },
    { label: "blue", color: "#2196F3" },
    { label: "pink", color: "#E91E63" },
    { label: "indigo", color: "#3F51B5" },
];
console.log("colorPickerOptions2:", colorPickerOptions2);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log('Індекс мітки "blue:"', colorPickerOptions2.findIndex(option => option.label === "blue")); //! 2
console.log('Індекс мітки "pink:"', colorPickerOptions2.findIndex(option => option.label === "pink")); //! 3
console.log('Індекс мітки "white:"', colorPickerOptions2.findIndex(option => option.label === "white")); //! -1
console.log("-------------------------------------------------------------------------");

//! Метод every()
console.warn("Синтаксис методу every():");
//? ✴️ Перевіряє, чи проходять ВСІ елементи масиву
//? тест колбек-функції.
//? Повертає true або false.
//? 🔸 Поелементо перебирає оригінальний масив.
//? 🔸 Не змінює оригінальний масив.
//? 🔸 Повертає true, якщо ВСІ елементи масиву задовольняють умову.
//? 🔸 Повертає false, якщо хоча б один елемент масиву не задовольняє умову.
//? 🔸 Перебирання масиву припиняється, якщо колбек повертає false.
//? ✳️ Аргументи колбек-функції - це:
//? 🔹 значення поточного елемента element,
//? 🔹 його індекс index
//? 🔹 і власне вихідний масив array.
console.log(
    `%c
    масив.every((element, index, array) => {
        // тіло колбек-функції
    });
    `,
    'color: blue; font-size: 18px',
);

console.warn("Приклад використання метода every():");
//? ✳️ Приклад-1:
//todo: УСІ елементи більші або дорівнюють нулю? - ТАК
console.log("УСІ елементи [1, 2, 3, 4, 5] більші або дорівнюють нулю? -", [1, 2, 3, 4, 5].every(value => value >= 0)); //! true


//todo:  УСІ елементи більші або дорівнюють нулю? - НІ
console.log("УСІ елементи [1, 2, 3, -10, 4, 5] більші або дорівнюють нулю? -", [1, 2, 3, -10, 4, 5].every(value => value >= 0)); //! false
console.log("-----------------------------------------------------------------------------------------");


//! Метод some()
console.warn("Синтаксис методу some():");
//? ✴️ Перевіряє, чи проходить хоча б ОДИН елемент масиву
//?  тест колбек-функції.
//? Повертає true або false.
//? 🔸 Поелементо перебирає оригінальний масив.
//? 🔸 Не змінює оригінальний масив.
//? 🔸 Повертає true, якщо хоча б ОДИН елемент масиву задовольняє умову.
//? 🔸 Повертає false, якщо жоден елемент масиву не задовольняє умову.
//? 🔸 Перебирання масиву припиняється, якщо колбек повертає false.
//? ✳️ Аргументи колбек-функції - це:
//? 🔹 значення поточного елемента element,
//? 🔹 його індекс index
//? 🔹 і власне вихідний масив array.
console.log(
    `%c
    масив.some((element, index, array) => {
        // тіло колбек-функції
    });
    `,
    'color: blue; font-size: 18px',
);

console.warn("Приклад використання метода some():");
//? ✳️ Приклад-2:
//todo:  Чи є хоча б один елемент, що більший або дорівнює нулю? - ТАК
console.log("Чи є хоча б один елемент з [1, 2, 3, 4, 5], що більший або дорівнює нулю? -", [1, 2, 3, 4, 5].some(value => value >= 0)); //! true

//todo:  Чи є хоча б один елемент, що більший або дорівнює нулю? - ТАК
console.log("Чи є хоча б один елемент з [-7, -20, 3, -10, -14], що більший або дорівнює нулю? -", [-7, -20, 3, -10, -14].some(value => value >= 0)); //! true

//todo:  Чи є хоча б один елемент, що менший нуля? - НІ
console.log("Чи є хоча б один елемент з [1, 2, 3, 4, 5], що менший нуля? -", [1, 2, 3, 4, 5].some(value => value < 0)); //! false

//todo:  Чи є хоча б один елемент, що менший нуля? - ТАК
console.log("Чи є хоча б один елемент з [1, 2, 3, -10, 4, 5], що менший нуля? -", [1, 2, 3, -10, 4, 5].some(value => value < 0)); //! true
console.log("-----------------------------------------------------------------------------------------");

