//! Встановлення Node.js
console.warn("Встановлення Node.js: \n https://nodejs.org/en/download/");
//? ✴️ Node.js — це відкрите середовище виконання JavaScript,
//? яке дозволяє виконувати JavaScript на стороні сервера.
//? Це означає, що з Node.js можна створювати серверні додатки,
//? які можуть обробляти запити від клієнтів, доступ до баз даних,
//? роботу з файлами, мережеві операції та багато іншого.

//? ✴️ Node.js був створений на основі двигуна V8,
//? який є основою для браузера Google Chrome.
//? Це дозволяє виконувати JavaScript з високою швидкістю і ефективністю.
//? Node.js також має велику кількість розширень (модулів),
//? які дозволяють легко додавати різноманітні функції до ваших додатків.


//! Перевірка версії Node.js
console.warn("Перевірка версії Node.js:");
console.log(
    `%c
    node -v
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------");



//! Створення нового файла test.js
console.warn("Створення нового файла test.js:");
console.log(
    `%c
    touch test.js
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------");



//! Запуск файлу test.js
console.warn("Запуск файлу test.js:");
console.log(
    `%c
    node test.js
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------");

//! Основні команди
console.warn("Основні команди:");
console.log(
    `%c
    pwd — показує поточну дерикторію, де ви знаходитесь
    ls — показати які файли і папки
    clear — очистити термінал або ctrl+l
    ls -l — показати всі файли
    ls -la — показати разом з прихованими файлами
    cd — навгація по папкам
    cd D: — виходить на диск D
    touch — створює новий файл
    mv — переіменовує/переміщує файл або папку
    mkdir — створює нову папку
    rm — видаляє файл
    rmdir — видаляє папку
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------");

//! JavaScript поза браузером - REPL (read-eval-print loop)
console.warn("JavaScript поза браузером - REPL (read-eval-print loop):");
//? ✳️ Node.js дозволяє виконувати JavaScript-код поза браузером.
//? Відкрийте будь-який термінал і виконайте команду node,
//? запуститься REPL (read-eval-print loop)
//? - інтерактивне середовище виконання JS-коду:
console.log(
    `%c
    $ node
    Welcome to Node.js v20.17.0.
    Type ".help" for more information.
    >
    (To exit, press Ctrl+C again or Ctrl+D or type .exit)
    >const message = "Hello world!"
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------");


//! Приклад використання REPL (read-eval-print loop)
console.warn("Приклад використання REPL (read-eval-print loop):");
console.log(
    `%c
    > const message = "Hello world!"
    undefined
    > console.log(message)
    Hello world!
    undefined
    >
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------");

//! Пакетний менеджер npm
console.warn("Сайт npmjs.com : \n https://www.npmjs.com/");
//? ✴️ Щоб використовувати все різноманіття
//? інструментів (або пакетів) Node.js,
//? нам необхідна можливість встановлювати
//? і керувати ними.
//? Для цього створений NPM (node ​​package manager)
//? - пакетний менеджер Node.js.
//? Він встановлює потрібні пакети і забезпечує
//? зручний інтерфейс для роботи з ними.

//? 📌 NPM складається з трьох основних компонентів:
//?     🔸 Сайт npmjs.com — використовується для пошуку та ознайомлення з документацією пакетів.
//?     🔸 Інтерфейс командного рядка (CLI)
//?         — запускається з терміналу і надає набір команд
//?         для роботи з реєстром і пакетами.
//?     🔸 Реєстр пакетів (registry) — велика загальнодоступна
//?         база даних інструментів розробки (пакетів).
console.log(
    `%c
    📌 Основні компоненти NPM:
        🔸 Сайт npmjs.com
        🔸 Інтерфейс командного рядка (CLI)
        🔸 Реєстр пакетів (registry)
    `,
    'color: blue; font-size: 18px',
);

//? ✳️ Пакет (package) — невелика JavaScript бібліотека, 
//? що вирішує специфічне завдання. 
//? Пакети пишуть самі розробники і діляться зі спільнотою. 
//? Такий підхід спрощує життя, тому що не потрібно 
//? винаходити колесо, всі колеса вже давно лежать 
//? на полицях реєстру і готові до використання.
console.log("-------------------------------------------------------------------");

//! Команди NPM
console.warn("Документація NPM: \n https://docs.npmjs.com/");
console.warn("Основні команди:");
console.log(
    `%c
    npm init — ініціалізує npm в проєкті і створює файл package.json
    npm install — встановлює всі залежності, перелічені в package.json
    npm list --depth=0 — виведе в терміналі список локально встановлених пакетів з номерами їх версій, без залежностей
    npm install [package-name] — встановить пакет локально у папку node_modules
    npm uninstall [package-name] — видалить пакет, встановлений локально і оновить package.json
    npm start і npm test — запустить скрипт start або test, розташований в package.json
    npm run [custom-script] — запустить кастомний скрипт, розташований в package.json
    npm outdated — використовується для пошуку оновлень, виявить сумісні версії програмно і виведе список доступних оновлень
    npm update — оновить всі пакети до максимально дозволеної версії
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------------------------");

//! Ініціалізація проєкту - npm init або npm init --yes
console.warn("Ініціалізація проєкту - npm init або npm init --yes:");
//? ✴️ Кожен проєкт починається зі створення файлу package.json
//? - він відстежує залежності, містить службову інформацію,
//? дозволяє писати npm-скрипти і слугує інструкцією
//? під час створення нового проєкту на основі вже готових налаштувань.
//? Файл package.json можна створити npm-командою init, що ініціалізує
//? проект в цій папці.

//? ✳️ Вам буде запропоновано ввести назву проекту, версію, опис тощо.
//? Можна просто натискати Enter доти, доки не буде створений package.json
//? і розміщений в папці проекту. Щоб не натискати Enter,
//? пропускаючи порожні поля, використовується команда init з прапорцем --yes.
//? Прапорець - додаткове налаштування для команди.
//? ✳️ У кожного прапорця є псевдонім - його скорочений запис. 
//? Псевдонім прапорця --yes - -y, 
//? тому команди npm init --yes і npm init -y 
//? роблять одне і те ж.
console.log(
    `%c
    npm init
        або
    npm init --yes
        або
    npm init --y
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------");


//! Встановлення значень name та email
console.warn("Встановлення значень name та email:");
console.log(
    `%c
    npm config set init.author.name "YOUR_NAME"
    npm config set init.author.email "YOUR_EMAIL"
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------");

//! npm-скрипти
console.warn("npm-скрипти:");
//? ✴️ Скрипти дозволяють запускати для виконання встановлені пакети. 
//? Використовуючи npm-скрипти, можна створювати цілі системи збирання проєкту. 
//? Автоматизуємо запуск index.js. 
//? Для цього у файлі package.json в полі scripts додамо скрипт запуску start.
console.log(
    `%c
    "scripts": {
    "test": "echo \"Error: no test specified\" && exit 1",
    "start": "node test.js"
    },
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------");

//! Використання пакетів
console.warn("Використання пакетів:");
//? ✴️ Щоб отримати інтерфейс пакета в Node.js-коді,
//? необхідно викликати функцію require("ім'я-модуля"),
//? передаючи аргументом їй ім'я модуля без визначення шляху
//? - це називається абсолютний імпорт.
//? Шлях не потрібен, оскільки за замовчуванням пошук модуля
//? буде відбуватися в папці node_modules.
//? Результатом свого виконання функція поверне інтерфейс модуля
//? - об'єкт з методами або просто функцію - залежить від пакета.
console.log(
    `%c
    const lodash = require('lodash');
    const sum = lodash.add(10, 5);
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------------------------------");

//! Видалення пакетів
console.warn("Видалення пакетів:");
//? ✴️ Припустимо, що версія lodash,
//? встановлена в попередньому прикладі,
//? викликає проблеми з сумісністю.
//? Ми можемо видалити цей пакет і поставити  версію.
console.log(
    `%c
    npm uninstall lodash
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------------------------------");

//! Встановлення певної версії пакета
console.warn("Встановлення певної версії пакета:");
//? ✴️ Тепер встановимо потрібну версію lodash.
//? У команді встановлення номер версії вказується після символу @.
console.log(
    `%c
    npm install lodash@4.17.20
    `,
    'color: blue; font-size: 18px',
);
console.log(". . . . . . . . . . . . . . . . . . . . . . .");
console.log(
    `%c
    "dependencies": {
    "lodash": "^4.17.20"
    }
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------------------------------");

//! Керування версіями пакетів
console.warn("Керування версіями пакетів:");
console.warn("SemVer - Semantic Versioning 2.0.0: \n https://semver.org/");
//? ✴️ Пакети мають пов'язаний з ними номер версії.
//? Номери версій відповідають стандарту SemVer.
//? 📌 Керування версіями пакетів:
//?     🔸 npm outdated - використовується для пошуку оновлень,
//?        виявить сумісні версії програмно.
//?     🔸 npm update - оновить всі пакети до максимально дозволеної версії.
//?     🔸 npm update [ім'я-пакета] - оновить зазначений пакет.
console.log(
    `%c
    🔸 npm outdated - використовується для пошуку оновлень,
       виявить сумісні версії програмно.
    🔸 npm update - оновить всі пакети до максимально дозволеної версії.
    🔸 npm update [ім'я-пакета] - оновить зазначений пакет.
    `,
    'color: blue; font-size: 18px',
);
//? ✳️ Якщо вам потрібна певна версія пакету,
//? можна відкрити package.json і вручну поміняти версії пакетів,
//? після чого виконати npm install.
console.log("-------------------------------------------------------------------------------------------------------------");

//! Керування кешем
console.warn("Керування кешем:");
//? ✴️ Після встановлення пакета npm зберігає його копію в кеші,
//? тому під час наступного встановлення,
//? вам не потрібно знову завантажувати його з інтернету.
//? Кеш зберігається в папці .npm вашого домашнього каталогу.
//? ✳️ Ця папка з часом засмічується старими пакетами
//? і її корисно іноді очищати, не дуже часто (декілька разів на рік).
//? Кешування корисне, тому що скорочує час встановлення
//? вже використаних пакетів.
console.log(
    `%c
    npm cache clean
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------------------------------");

//! Типи залежностей
//? ✴️ Деякі залежності будуть використані у фінальному проекті,
//? інші необхідні тільки на стадії розробки,
//? а є й такі, які необхідно використовувати, незалежно від проекту.

//? 📌 Саме для цього команди npm install і npm uninstall мають три прапорці:

//?     🔸 -save - вказує, що додається залежність,
//?         яка увійде до фінального продукту.
//?         Пакет буде встановлений локально,
//?         в папку node_modules і буде доданий запис
//?         в поле dependencies в package.json.
    
//?     🔸 -save-dev - вказує, що додається залежність розробки.
//?         Пакет буде встановлений локально в папку node_modules,
//?         і буде доданий запис в поле devDependencies в package.json.
    
//?     🔸 -global - вказує, що додається глобальна залежність,
//?         тобто інструмент, який доступний для будь-якого проекту.
//?         Пакет буде встановлений глобально (в систему).

console.log(
    `%c
    🔸 -save - вказує, що додається залежність,
        яка увійде до фінального продукту.
        Пакет буде встановлений локально,
        в папку node_modules і буде доданий запис
        в поле dependencies в package.json.

    🔸 -save-dev - вказує, що додається залежність розробки.
        Пакет буде встановлений локально в папку node_modules,
        і буде доданий запис в поле devDependencies в package.json.

    🔸 -global - вказує, що додається глобальна залежність,
        тобто інструмент, який доступний для будь-якого проекту.
        Пакет буде встановлений глобально (в систему).
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------------------------");

//! Бібліотека
console.warn("Бібліотека:");
//? ✴️ Бібліотека — це структурований набір корисного функціоналу:
//? функцій, об'єктів або класів, які ви можете використовувати
//? в своєму додатку. Бібліотека абстрагує різні шари,
//? так що вам не потрібно турбуватися про їх деталі реалізації.
//? Бібліотека скорочує час розробки, дозволяючи вам не турбуватися
//? про дрібниці.

//? ✳️ Бібліотека може містити функції для роботи з рядками,
//? датами, DOM-елементами, подіями, анімацією, HTTP-запитами,
//? і багато іншого. Кожна функція може повертати значення коду,
//? який її викликає, який може в подальшому використовувати їх
//? в залежності від логіки розробника.

//? ✳️ Це можна порівняти з підбором запчастин для автомобіля:
//? ви вільні у виборі будь-якого варіанту, з яким машина буде працювати,
//? але логіка цілком на вашій совісті.

//?     📌 Мінуси використання бібліотек:
//? 🔸 Баг в реалізації бібліотеки може викликати складності в його знаходженні і виправленні.
//? 🔸 Немає гарантії, що команда розробників оперативно випустить патч.
//? 🔸 Патч може змінити API, що спричинить за собою значні зміни у вашому коді.

console.log(
    `%c
    📌 Мінуси використання бібліотек:
        🔸 Баг в реалізації бібліотеки може викликати складності в його знаходженні і виправленні.
        🔸 Немає гарантії, що команда розробників оперативно випустить патч.
        🔸 Патч може змінити API, що спричинить за собою значні зміни у вашому коді.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------");


//! Фреймворк
console.warn("Фреймворк:");
//? ✴️ Фреймворк — це каркас (скелет) додатка.
//? Він зобов'язує розробника будувати архітектуру програми відповідно до деякої логікою,
//? а так само надає деякий інтерфейс для взаємодії з собою. Фреймворк зазвичай
//? надає функціонал на кшталт подій, сховищ і зв'язування даних, шаблонізацію та інше.

//? ✳️ За аналогією з машиною, фреймворк надає готові рами, корпус і двигун.
//? Ви можете додавати, видаляти або замінювати деякі деталі, при цьому припускаючи,
//? що автомобіль залишиться в робочому стані.

//? ✳️ Фреймворк знаходиться на більш високому рівні абстракції в порівнянні
//? з бібліотекою і дозволить вам без зусиль побудувати велику частину програми.

//? ✳️ Різниця між фреймворком і бібліотекою полягає в тому, що бібліотеку
//? ви використовуєте в своєму коді, а у випадку з фреймворком,
//? ви пишете свій код в архітектурних конструкціях фреймворку.


//?     📌Мінуси використання фреймворку:
//? 🔸 Фреймворк може накладати обмеження, тому можуть бути труднощі з впровадженням функціоналу.
//? 🔸 Велика екосистема пакетів може збивати з пантелику і вимагає часу на вивчення.

console.log(
    `%c
    📌 Мінуси використання фреймворку:
        🔸 Фреймворк може накладати обмеження, тому можуть бути труднощі з впровадженням функціоналу.
        🔸 Велика екосистема пакетів може збивати з пантелику і вимагає часу на вивчення.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------");


//! Інструмент
console.warn("Інструмент:");
//? ✴️ Інструмент — це допоміжний засіб розробки,
//? але він не є невід'ємною частиною проєкту.
//? Інструменти включають в себе системи збирання, лінтери,
//? компілятори, транспайлери, системи розгортання та інше.

//? ✳️ Інструменти покликані полегшувати процес розробки. 
//? Наприклад, Babel, який надає можливість перетворення 
//? сучасного зручного в написанні JavaScript в більш старий стандарт, 
//? який може обробити більшість браузерів.
console.log("-------------------------------------------------------------------");

//! Бібліотека nanoid
console.warn("Бібліотека nanoid на NPM: \n https://www.npmjs.com/package/nanoid");
console.warn("Бібліотека nanoid на GitHub: \n https://github.com/ai/nanoid/blob/HEAD/README.ru.md");


//! Встановлення бібліотеки nanoid
console.warn("Встановлення бібліотеки nanoid:")
console.log(
    `%c
    npm i nanoid
    `,
    'color: blue; font-size: 18px',
);
console.log("----------------------------------------------------------------------------------");


//! Використання бібліотеки nanoid
console.warn("Використання бібліотеки nanoid:")
console.log(
    `%c
    import { nanoid } from 'nanoid'
    const id = nanoid();
    console.log("id:", id); //! LwSYuYYuT74FtNmT5pfl8
    `,
    'color: blue; font-size: 18px',
);
console.log("----------------------------------------------------------------------------------");

//! Модульність коду
console.warn("Модульність коду:");
//? ✴️ Модульний код допомагає в організації, обслуговуванні,
//? тестуванні й, саме головне, управлінні залежностями.
//? Найбільш важливі переваги модулів це підтримувані,
//? простір імен і повторне використання.
//?    📌
//? 🔸 Підтримування — добре розроблений модуль покликаний
//?    максимально знизити залежність від інших частин коду.
//?    Це дозволить розширювати функціонал додатка не побоюючись
//?    порушити його роботу в цілому. Оновлення одного модуля
//?    набагато простіше, якщо модуль самодостатній.
//? 🔸 Простір імен — змінні, що не входять в зону видимості функції,
//?    є глобальними. Через це зазвичай відбувається забруднення простору імен,
//?    де повністю непов'язаний код розділяє глобальні змінні.
//?    Модулі дозволяють уникнути забруднення простору імен,
//?    створюючи окрему область видимості для змінних.
//? 🔸 Повторне використання — всі розробники копіювали готовий код
//?    в нові проєкти, змінюючи його під специфіку проєкту.
//?    Це, очевидно, величезна трата часу. Набагато краще коли є модуль,
//?    який можна повторно використовувати знову і знову без необхідності
//?    знати що-небудь про оточення в якому він використовується.
console.log(
    `%c
    Модульний код допомагає в організації, обслуговуванні,
    тестуванні й, саме головне, управлінні залежностями.

    Найбільш важливі переваги модулів це:
    🔸 Підтримування
    🔸 Простір імен
    🔸 Повторне використання
    `,
    'color: blue; font-size: 18px',
);
console.log("------------------------------------------------------------------------------------------");


//! Збірка модулів
console.warn("Збірка модулів:");
//? ✴️ Збірка модулів — це процес конкатенації групи модулів,
//? і їх залежностей, в один або групу файлів.
console.log(
    `%c
    Збірка модулів — це процес конкатенації групи модулів,
    і їх залежностей, в один або групу файлів.
    `,
    'color: blue; font-size: 18px',
);
//? ✳️ Зазвичай код ділять на папки і файли, до того ж необхідно
//? підключити зовнішні бібліотеки. В результаті, кожен з цих файлів
//? потрібно включити в основний HTML-файл в тезі script,
//? який потім завантажується браузером.
//? ✳️ Наявність окремих тегів script для кожного файлу означає,
//? що браузер буде завантажувати кожен файл окремо,
//? що негативно позначається на швидкості завантаження сторінки
//? (HTTP / 2 трохи допомагає з розв'язання цієї проблеми).
//? Щоб обійти цю проблему, файли об'єднуються в один або пару файлів,
//? щоб зменшити кількість запитів. Але залишається проблема управління
//? залежностями між модулями.
//? ✳️ Якщо використовуються системи модулів які браузери не підтримують, 
//? такі як CommonJS або ESM, необхідно використовувати інструмент 
//? для їх перетворення в правильно впорядкований, доступний браузеру код. 
//? Саме тут вступають в дію Webpack, Parcel і інші бандлери (від англійського bundle).
console.log("------------------------------------------------------------------------------------------");

